fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДолжностьСпециалиста</name>
    <type>
      <types>CatalogRef.ВКМ_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Ответсвенный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ВКМ_ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Должность</name>
    <type>
      <types>CatalogRef.ВКМ_ДолжностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ВКМ_Сотрудники/ВКМ_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_Сотрудники</name>
  <predefined>
    <items>
      <name>ИвановИванИванович</name>
      <description>Иванов Иван Иванович</description>
    </items>
    <items>
      <name>ПетровИгорьЮрьевич</name>
      <description>Петров Игорь Юрьевич</description>
    </items>
    <items>
      <name>ВасильевИльяИгоревич</name>
      <description>Васильев Илья Игоревич</description>
    </items>
    <items>
      <name>МалиноваЮлияПетровна</name>
      <description>Малинова Юлия Петровна</description>
    </items>
    <items>
      <name>ДенисоваИринаАлексеевна</name>
      <description>Денисова Ирина Алексеевна</description>
    </items>
  </predefined>
  <attributes>
    <name>ВКМ_Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Должность</name>
    <type>
      <types>CatalogRef.ВКМ_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПроцентЗаВыполненныеРаботыКлиентам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

   Запрос = Новый Запрос;
   Запрос.Текст =
        	"ВЫБРАТЬ
        	|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание) КАК ДоговорНеАбонентскоеОбслуживание,
        	|	ВКМ_ОбслуживаниеКлиента.Дата < ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДатаНачалаДоговора
        	|		ИЛИ ВКМ_ОбслуживаниеКлиента.Дата > ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДатаОкончанияДоговора КАК Дата
        	|ИЗ
        	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
        	|ГДЕ
        	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
        	
   Запрос.УстановитьПараметр("Ссылка", Ссылка);	
        
   РезультатЗапроса = Запрос.Выполнить();
        
   ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
   Если ВыборкаДетальныеЗаписи.Следующий() Тогда
        	
        Если ВыборкаДетальныеЗаписи.ДоговорНеАбонентскоеОбслуживание И ВыборкаДетальныеЗаписи.Дата Тогда
        		
        	  Отказ = Истина;
        	  Сообщение = СтрШаблон("Невозможно проведение документа по Договору %1", ВКМ_Договор);
        	  Сообщить(Сообщение);   
        	
        КонецЕсли;      	     	
        	
   КонецЕсли;
        
    Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
    Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
    Движение.Период = Дата;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.ВКМ_КоличествоЧасов = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ЧасыКОплатеКлиенту");
				
     Запрос = Новый Запрос;
     Запрос.Текст =
        	"ВЫБРАТЬ
        	|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_ДоговорВКМ_СтоимостьЧасаРаботы
        	|ИЗ
        	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
        	|ГДЕ
        	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
        
     Запрос.УстановитьПараметр("Ссылка", Ссылка);
        
     РезультатЗапроса = Запрос.Выполнить();
        
     ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        	Движение.ВКМ_СуммаКОплате = Движение.ВКМ_КоличествоЧасов * ВыборкаДетальныеЗаписи.ВКМ_ДоговорВКМ_СтоимостьЧасаРаботы;
    КонецЦикла;

    Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
    Запрос = Новый Запрос;
    Запрос.Текст =
    	"ВЫБРАТЬ
    	|	ВКМ_Сотрудники.ВКМ_ПроцентЗаВыполненныеРаботыКлиентам КАК ВКМ_ПроцентЗаВыполненныеРаботыКлиентам,
    	|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту КАК ВКМ_ЧасыКОплатеКлиенту,
    	|	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист КАК ВКМ_Специалист,
    	|	ВКМ_ОбслуживаниеКлиента.ВКМ_ДолжностьСпециалиста КАК ВКМ_ДолжностьСпециалиста
    	|ИЗ
    	|	Документ.ВКМ_ОбслуживаниеКлиента.ВКМ_ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы
    	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
    	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
    	|			ПО ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист = ВКМ_Сотрудники.Ссылка
    	|		ПО ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
    	|ГДЕ
    	|	ВКМ_Сотрудники.Ссылка = &Специалист
    	|	И ВКМ_ОбслуживаниеКлиента.Ссылка = &Документ
    	|	И ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка = &Документ";
    
    Запрос.УстановитьПараметр("Специалист", ВКМ_Специалист);  
	Запрос.УстановитьПараметр("Документ", 	Ссылка); 
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    	
		Если ВыборкаДетальныеЗаписи.ВКМ_ПроцентЗаВыполненныеРаботыКлиентам = "" Тогда
			Возврат;
		КонецЕсли;	
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВКМ_Сотрудник = ВыборкаДетальныеЗаписи.ВКМ_Специалист; 
		Движение.ВКМ_Должность = ВыборкаДетальныеЗаписи.ВКМ_ДолжностьСпециалиста;
		Движение.ВКМ_ЧасовКОплате = ВыборкаДетальныеЗаписи.ВКМ_ЧасыКОплатеКлиенту;
    	Движение.ВКМ_СуммаКОплате = ВыборкаДетальныеЗаписи.ВКМ_ЧасыКОплатеКлиенту * ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы * ВыборкаДетальныеЗаписи.ВКМ_ПроцентЗаВыполненныеРаботыКлиентам  / 100;
    	
    КонецЦикла;
    
КонецПроцедуры    

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;
		
	ВКМ_ТекстСообщения = ПолучитьТекстИзменения(); 
	
	Если Не ЗначениеЗаполнено(ВКМ_ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	НовыйТекстИзменения = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйТекстИзменения, ЭтотОбъект); 
	
	НовыйТекстИзменения.Записать();
	
КонецПроцедуры  

Функция ПолучитьТекстИзменения()
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
		
		ТекстСообщения = СтрШаблон("Создан новый документ специалистом %1 от %2", ВКМ_Специалист, Дата);
		
	КонецЕсли;  
	
	Если Не ЭтотОбъект.ЭтоНовый() Тогда  
		
		ДатаДокумента = '00010101';  
		
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист КАК ВКМ_Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка"; 
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		
		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда   
			
			ДатаДокумента = Выборка.Дата;
			СпециалистВДокументе = Выборка.ВКМ_Специалист;
			
		КонецЕсли;    
		
		
		Если СпециалистВДокументе <> ВКМ_Специалист Тогда     
			
			ТекстСообщения = СтрШаблон("В документе %1 специалист %2 изменился на %3", Ссылка, СпециалистВДокументе, ВКМ_Специалист);     
			
		КонецЕсли; 
		
		Если ДатаДокумента <> Дата Тогда     
			
			ТекстСообщения = СтрШаблон("В документе %1 дата %2 изменилась на %3", Ссылка, ДатаДокумента, Дата);     
			
		КонецЕсли;
		
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		Возврат ТекстСообщения; 
		
	КонецЕсли;    
		
КонецФункции	
    
#КонецОбласти  

#КонецЕсли
